{
  "!": 3,
  "!!": 1345,
  "!!!": 28696,
  "!!!!": 2637,
  "!!!!!!": 4269,
  "!!!!!!!!": 31792,
  "!!(": 48537,
  "!!\\": 41564,
  "!\"": 19289,
  "!\")": 32265,
  "!\");": 10924,
  "!\",": 17486,
  "!\";": 40921,
  "!'": 36931,
  "!');": 47875,
  "!',": 34994,
  "!(": 5085,
  "!(\"": 13653,
  "!)": 27133,
  "!,": 41500,
  "!--": 10927,
  "!.": 30238,
  "!/": 25779,
  "!;": 45711,
  "!=": 4674,
  "!=\"": 32205,
  "!='": 49415,
  "!=(": 20654,
  "!==": 4569,
  "!==!": 37212,
  "!==\"": 43741,
  "!==(": 42670,
  "![": 16858,
  "!\\": 7557,
  "\"": 4,
  "\"!=": 14829,
  "\"!==": 15654,
  "\"\"": 1501,
  "\"\"\"": 6394,
  "\"\"\",": 40586,
  "\"\"'\");": 39009,
  "\"\").": 36395,
  "\"\",": 20000,
  "\"\":": 15878,
  "\"\"\\": 17353,
  "\"\"},": 9713,
  "\"#": 24789,
  "\"$": 46965,
  "\"%": 12166,
  "\"&": 24615,
  "\"&&": 31229,
  "\"'": 17592,
  "\"',": 18700,
  "\"','": 26913,
  "\"(": 10449,
  "\")": 866,
  "\")&&": 32773,
  "\")&&(": 41232,
  "\"))": 2646,
  "\")))": 15338,
  "\")));": 10849,
  "\")),": 10483,
  "\")).": 15616,
  "\"));": 2944,
  "\")){": 28869,
  "\")+": 28553,
  "\")+\"": 35579,
  "\"),": 1557,
  "\"),\"": 43924,
  "\")->": 37162,
  "\").": 3101,
  "\"):": 11462,
  "\");": 638,
  "\")==": 44969,
  "\")?": 31245,
  "\")[": 23936,
  "\")]": 4191,
  "\")]),": 36551,
  "\"){": 19090,
  "\")||": 27855,
  "\")}": 18037,
  "\")},": 10987,
  "\"+": 1849,
  "\"+\"": 2463,
  "\"+(": 37281,
  "\",": 347,
  "\",!": 25556,
  "\",\"": 886,
  "\",\"\"+\"": 2867,
  "\",\"\",\"": 43938,
  "\",\"#": 37564,
  "\",\"$": 42944,
  "\",\"./": 29394,
  "\",\"\\": 18287,
  "\",\"__": 4992,
  "\",$": 35778,
  "\",&": 33401,
  "\",(": 28743,
  "\",[": 24490,
  "\",[\"": 23750,
  "\",\\": 33019,
  "\",{": 10277,
  "\",},": 32334,
  "\"-": 25569,
  "\"--": 47802,
  "\"----------\\": 23890,
  "\".": 3452,
  "\".$": 27190,
  "\"/": 17577,
  "\"/>": 6254,
  "\"/>.": 27093,
  "\"/>.</": 36811,
  "\"/></": 34993,
  "\":": 788,
  "\":\"": 2519,
  "\":\"\",\"": 19161,
  "\":\"\\": 25858,
  "\":\"_": 36245,
  "\":[": 17193,
  "\":[\"": 28796,
  "\":[{\"": 29422,
  "\":{": 25549,
  "\":{\"": 9244,
  "\";": 952,
  "\";})": 2411,
  "\";})(),(": 2418,
  "\"<": 22266,
  "\"</": 29237,
  "\"<<": 49447,
  "\"==": 7639,
  "\"===": 7212,
  "\"=>": 22117,
  "\"=>\"": 33370,
  "\">": 1845,
  "\">'": 23902,
  "\">';": 43537,
  "\"><": 9108,
  "\"></": 8318,
  "\"><?": 28146,
  "\">\\": 46939,
  "\"?": 27550,
  "\"?:": 47978,
  "\"[": 20997,
  "\"\\": 4003,
  "\"]": 2678,
  "\"]',": 50240,
  "\"](": 29300,
  "\"])": 13015,
  "\"]))": 43115,
  "\"]),": 35148,
  "\"]);": 22637,
  "\"],": 4279,
  "\"],\"": 24732,
  "\"],[\"": 23861,
  "\"],[\"@@": 42333,
  "\"].": 9052,
  "\"]:": 28467,
  "\"];": 12456,
  "\"]=": 29601,
  "\"][": 13309,
  "\"][\"": 18597,
  "\"]],": 41703,
  "\"]},": 38613,
  "\"_": 24668,
  "\"`": 2537,
  "\"`,": 50234,
  "\"{": 16361,
  "\"||": 41398,
  "\"}": 6629,
  "\"})": 17470,
  "\"}),": 29750,
  "\"});": 24308,
  "\"},": 1782,
  "\"},\"": 14680,
  "\"},{": 11206,
  "\"},{\"": 16834,
  "\"},{\\\"": 41460,
  "\"};": 15193,
  "\"}\\": 27202,
  "\"}],": 35644,
  "\"}],\"": 41648,
  "\"}}": 23733,
  "\"}},": 13511,
  "\"}},[": 33758,
  "#": 5,
  "#\"": 35286,
  "##": 715,
  "##\"": 45309,
  "###": 5650,
  "####": 1304,
  "########": 2470,
  "############": 20639,
  "################": 4285,
  "################################": 8467,
  "################################################################": 18757,
  "############################################################################": 28062,
  "#############################################################################": 33873,
  "####;": 31928,
  "####;####": 32897,
  "####=####": 35443,
  "####[": 36372,
  "####[####": 36381,
  "####]": 36376,
  "####]####=####": 38183,
  "###;": 41309,
  "###;###": 42963,
  "###=###": 46171,
  "###[": 47204,
  "###[###": 47330,
  "###]": 47312,
  "###]###=###": 49778,
  "##(": 30167,
  "##_": 8325,
  "##_##": 31880,
  "#$": 49147,
  "#%": 44769,
  "#;#": 31543,
  "#;#_#": 34834,
  "#=#": 33868,
  "#[": 27060,
  "#[#": 34709,
  "#\\": 20275,
  "#]": 31526,
  "#]#=#": 36484,
  "#{": 15580,
  "#Ā": 47544,
  "$": 6,
  "$\"": 39183,
  "$\");": 46638,
  "$\",": 24949,
  "$$": 11088,
  "$',": 36337,
  "$(": 21072,
  "$,": 36135,
  "$.": 11202,
  "$/": 9733,
  "$/,": 23041,
  "$/.": 36919,
  "$\\": 20284,
  "$_": 17863,
  "${": 5415,
  "%": 7,
  "%\"": 24420,
  "%\",": 30616,
  "%%": 4183,
  "%%%%": 7484,
  "%%%%%%%%": 12127,
  "%%%%%%%%%%%%%%%%": 19932,
  "%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%": 36268,
  "%'": 49810,
  "%',": 39819,
  "%,": 34557,
  "%-": 40831,
  "%.": 24182,
  "%;": 28174,
  "%[": 35270,
  "%\\": 23126,
  "&": 8,
  "&#": 9891,
  "&&": 1411,
  "&&!": 11183,
  "&&\"": 12227,
  "&&(": 3284,
  "&&(\"": 41453,
  "&&)": 44299,
  "&(": 21443,
  "&)": 12158,
  "&);": 16145,
  "&,": 11791,
  "&=": 47808,
  "&>": 29897,
  "&>(": 32127,
  "&\\": 28207,
  "'": 9,
  "'\"": 19255,
  "'\")": 47168,
  "'\");": 19301,
  "'\",": 12290,
  "'%": 38093,
  "''": 8886,
  "'''": 37549,
  "'(": 44797,
  "')": 1359,
  "')(": 42836,
  "'))": 5544,
  "')))": 30338,
  "')));": 40256,
  "')),": 22040,
  "')).": 19385,
  "'));": 8088,
  "'),": 3033,
  "')->": 13606,
  "').": 5644,
  "'):": 10551,
  "');": 1823,
  "')[": 27295,
  "')]": 35208,
  "')])": 38137,
  "')],": 36826,
  "')]],": 48188,
  "'){": 40108,
  "')}": 34577,
  "'*": 43527,
  "'+": 15637,
  "'+'": 8410,
  "',": 463,
  "',$": 43838,
  "','": 1242,
  "','\"','": 43153,
  "','','": 14098,
  "','','','','": 25789,
  "',';','": 46876,
  "','=','": 41964,
  "','=',']','": 49297,
  "','[','": 35176,
  "','\\": 6655,
  "',/*": 9806,
  "',/**/": 21659,
  "',/**/'": 4750,
  "',/**/';',/**/'": 36618,
  "',/**/'=',/**/'": 43731,
  "',/**/'[',/**/'": 43458,
  "',/**/']": 43219,
  "',/**/']',/**/'=',/**/'": 49054,
  "'-": 39547,
  "'.": 5193,
  "'.$": 41172,
  "'/": 33434,
  "'/>": 45491,
  "':": 1423,
  "':'": 14937,
  "':'\\": 31746,
  "';": 1563,
  "';'": 44357,
  "';',/**/'": 27264,
  "';\\": 36474,
  "'<": 23166,
  "'</": 34784,
  "'=>": 8852,
  "'=>$": 45667,
  "'=>'": 11627,
  "'>": 11645,
  "'>;": 48229,
  "'><": 41171,
  "'></": 41080,
  "'\\": 4437,
  "'\\\\": 47729,
  "']": 1515,
  "'](": 42639,
  "'])": 6462,
  "']))": 11267,
  "']));": 39264,
  "']),": 26415,
  "']).": 34564,
  "']);": 8855,
  "'],": 4211,
  "']->": 32437,
  "'].": 10714,
  "']:": 24116,
  "'];": 7542,
  "']>;": 47351,
  "'][": 17348,
  "'][$": 22007,
  "']['": 6982,
  "'][]": 42151,
  "']]": 34657,
  "']],": 13269,
  "']]],": 27329,
  "']}": 50024,
  "'d": 12446,
  "'ll": 10768,
  "'m": 16313,
  "'re": 6077,
  "'s": 1554,
  "'t": 1596,
  "'ve": 12499,
  "'{": 40762,
  "'|'": 44397,
  "'}": 15236,
  "'})": 34150,
  "'}),": 34788,
  "'});": 32550,
  "'},": 9746,
  "'}}": 20426,
  "(": 10,
  "(!": 2695,
  "(!$": 43679,
  "(!(": 13743,
  "(!_": 34968,
  "(\"": 435,
  "(\"\")": 24229,
  "(\"\"))": 46795,
  "(\"\"));": 45646,
  "(\"\"),": 23718,
  "(\"\").": 49703,
  "(\"\");": 16003,
  "(\"\")]": 31741,
  "(\"\",": 15185,
  "(\"#": 11725,
  "(\"$": 17129,
  "(\"%": 3297,
  "(\"%#": 29622,
  "(\"&": 30219,
  "(\"'": 28586,
  "(\"(": 20095,
  "(\"(\"": 49233,
  "(\"(%": 32509,
  "(\"*": 22037,
  "(\"+": 18312,
  "(\",": 11123,
  "(\",\"": 40669,
  "(\",\");": 31738,
  "(\"-": 11986,
  "(\"--": 18280,
  "(\".": 9355,
  "(\"../": 21308,
  "(\"../../": 35299,
  "(\"./": 12634,
  "(\"/": 6710,
  "(\"/\")": 46003,
  "(\"//": 36646,
  "(\":": 19148,
  "(\";": 37792,
  "(\"<": 11861,
  "(\"</": 33289,
  "(\"?": 49265,
  "(\"@": 24084,
  "(\"[": 9346,
  "(\"[%": 33287,
  "(\"\\": 5523,
  "(\"\\\"": 31650,
  "(\"\\\\": 23512,
  "(\"^": 20611,
  "(\"^([": 49068,
  "(\"_": 12464,
  "(\"_\"),": 35287,
  "(\"__": 25912,
  "(\"{": 12936,
  "(\"|": 34631,
  "(\"}\");": 48993,
  "(#": 21670,
  "(#)": 40159,
  "($": 1163,
  "($\"": 22609,
  "($\"{": 48041,
  "($(": 49449,
  "($.": 33372,
  "($_": 13389,
  "(${": 37220,
  "(%": 5616,
  "(%%": 45514,
  "(%[": 32857,
  "(&": 699,
  "(&$": 41518,
  "(&(": 11670,
  "(&(*": 32588,
  "(&::": 34880,
  "(&_": 11508,
  "('": 831,
  "('\"": 32539,
  "('#": 12721,
  "('$": 43904,
  "('%": 22431,
  "('')": 46545,
  "('');": 32848,
  "('',": 34405,
  "(',": 24550,
  "(','": 21305,
  "(',',": 41573,
  "('-": 20897,
  "('--": 22325,
  "('.": 11311,
  "('.');": 48714,
  "('.',": 47909,
  "('../": 17005,
  "('../../": 24128,
  "('./": 10255,
  "('./_": 31815,
  "('/": 10155,
  "('/')": 49268,
  "('/',": 45825,
  "(':": 27288,
  "('<": 17198,
  "('@": 34144,
  "('[": 27658,
  "('\\": 13417,
  "('\\\\": 38567,
  "('_": 18213,
  "('_'),": 39855,
  "('{": 31809,
  "('|": 48860,
  "((": 931,
  "((\"": 13925,
  "((\"%": 40297,
  "((&": 34409,
  "(((": 4715,
  "((((": 13938,
  "(((((": 37537,
  "(()": 7394,
  "(())": 27262,
  "((*": 9275,
  "((-": 45169,
  "((?:": 41543,
  "((_": 24516,
  "((__": 13773,
  "()": 336,
  "()!=": 48336,
  "()\"": 32059,
  "()\");": 24476,
  "()\",": 25291,
  "()&&": 31958,
  "()'": 31591,
  "()',": 40029,
  "()(": 9990,
  "()()": 20276,
  "()()()()": 34775,
  "()(),": 40665,
  "())": 1202,
  "()))": 5037,
  "())))": 28920,
  "())));": 23948,
  "())),": 30473,
  "())).": 29216,
  "()));": 4768,
  "()),": 5058,
  "())->": 25762,
  "()).": 5093,
  "()):": 26638,
  "());": 1080,
  "()){": 19690,
  "())},": 38352,
  "()*": 23149,
  "()+": 17526,
  "()+\"": 39517,
  "(),": 833,
  "(),\"": 39670,
  "(),(": 2412,
  "()-": 16463,
  "()->": 3185,
  "().": 1033,
  "().(": 30996,
  "().(*": 26117,
  "().__": 28414,
  "()/": 23414,
  "():": 3721,
  "();": 491,
  "();)": 47534,
  "();\\": 20722,
  "();}": 31844,
  "()</": 29886,
  "()==": 22926,
  "()>": 22557,
  "()?": 25432,
  "()?;": 44440,
  "()[": 9370,
  "()\\": 22334,
  "()]": 8610,
  "()])": 45827,
  "()]);": 39397,
  "()],": 28772,
  "()].": 45579,
  "()];": 21260,
  "()`": 19169,
  "()`.": 48653,
  "(){": 1606,
  "(){}": 37225,
  "(){},": 44467,
  "()||": 34444,
  "()}": 9512,
  "()})": 38740,
  "()}),": 40103,
  "()});": 42713,
  "()},": 11615,
  "()}.": 38116,
  "()};": 27061,
  "()}}": 44131,
  "()}},": 47340,
  "(*": 1717,
  "(*(": 14376,
  "(*((": 50180,
  "(*)": 34760,
  "(*)(": 39017,
  "(**": 20696,
  "(*_": 41205,
  "(+": 28683,
  "(++": 27318,
  "(,": 41809,
  "(-": 3467,
  "(--": 31213,
  "(.": 19389,
  "(...": 19565,
  "(...)": 17434,
  "(/": 6886,
  "(/*": 29490,
  "(/\\": 16447,
  "(/^": 23991,
  "(/^\\": 40857,
  "(:": 6338,
  "(::": 11086,
  "(;": 15835,
  "(;;)": 49487,
  "(<": 16066,
  "(?": 14203,
  "(?:": 6100,
  "(?:[": 34459,
  "(?:\\": 28531,
  "(@": 7965,
  "(@\"": 35057,
  "([": 3460,
  "([\"": 15795,
  "([&": 38878,
  "(['": 12123,
  "([[": 23617,
  "([\\": 27809,
  "([]": 4661,
  "([])": 45474,
  "([]);": 46775,
  "([]*": 27302,
  "([],": 31421,
  "([^": 25588,
  "(\\": 7963,
  "(\\\"": 19969,
  "(\\\\": 25697,
  "(_": 1706,
  "(_(\"": 29776,
  "(_)": 21573,
  "(_,": 25536,
  "(_.": 21565,
  "(__": 2274,
  "(`": 7609,
  "(`${": 31514,
  "({": 2731,
  "({\"": 20493,
  "({'": 30319,
  "({{": 41539,
  "({})": 46285,
  "({},": 15125,
  "(|": 13001,
  "(||": 42443,
  "(~": 20517,
  "(Ā": 37924,
  ")": 11,
  ")!=": 25993,
  ")!==": 50165,
  ")\"": 8077,
  ")\")": 18353,
  ")\"));": 36898,
  ")\"),": 31042,
  ")\");": 9014,
  ")\")]": 41163,
  ")\",": 4395,
  ")\",\"": 21538,
  ")\";": 19662,
  ")\"},": 22804,
  ")$": 21970,
  ")$/": 32367,
  ")%": 17224,
  ")&": 7841,
  ")&&": 7970,
  ")&&!": 38909,
  ")&&(": 11738,
  ")'": 16646,
  ")')": 41887,
  ")');": 40530,
  ")',": 9867,
  ")','": 41362,
  ")(": 1261,
  ")(\"": 30682,
  ")(&": 27824,
  ")(&((": 44518,
  ")((": 8282,
  ")(((": 16205,
  ")((__": 47873,
  ")()": 36868,
  ")();": 27666,
  ")(*": 38293,
  ")(-": 39581,
  ")(?": 49276,
  ")(?:": 31917,
  ")(\\": 48910,
  ")(\\\\": 40402,
  ")(_": 35423,
  ")(__": 21113,
  "))": 452,
  "))\",": 39519,
  "))&": 28109,
  "))&&": 31039,
  "))&&(": 33541,
  "))(": 31956,
  ")))": 2135,
  "))))": 6726,
  ")))))": 36363,
  "))))))))": 21355,
  "))))))))))))))))": 36404,
  ")))));": 48296,
  ")))),": 36210,
  "))));": 18590,
  ")))){": 45190,
  "))),": 15437,
  "))).": 31091,
  ")));": 3442,
  "))){": 24888,
  "))*": 30832,
  "))*(": 44621,
  "))+": 28131,
  ")),": 2056,
  "))->": 21212,
  ")).": 4518,
  "))/": 31208,
  ")):": 11858,
  ")):(": 38498,
  "));": 619,
  "));\\": 39865,
  "));}": 44112,
  "))>>": 45019,
  "))?": 21074,
  "))[": 23415,
  "))\\": 45223,
  "))]": 13870,
  ")){": 7934,
  "))|": 33791,
  "))}": 15551,
  "))},": 16641,
  "))}}": 45018,
  ")*": 4607,
  ")*(": 16321,
  ")**": 30127,
  ")*/": 16281,
  ")+": 6464,
  ")+\"": 26367,
  ")+(": 29090,
  ")++;": 28009,
  "),": 399,
  "),!": 26441,
  "),\"": 18420,
  "),%": 45111,
  "),(": 3585,
  "),(\"": 1868,
  "),('": 39246,
  "),\\": 21922,
  "),_": 44894,
  ")-": 5600,
  ")-(": 40787,
  ")->": 2228,
  ").": 717,
  ").\"": 48256,
  ").\",": 38130,
  ").(": 32319,
  ").(*": 47916,
  ")...": 28068,
  ")...)": 44553,
  ").</": 35278,
  ").\\": 23773,
  ")._": 41716,
  ").__": 17839,
  ")/": 5043,
  ")/(": 20910,
  ")/,": 32504,
  "):": 1050,
  "):\"": 32720,
  "):(": 18040,
  ")::": 8753,
  ");": 267,
  ");\"": 34054,
  ");\",": 36378,
  ");)": 47301,
  ");*/": 41394,
  ");//": 30015,
  ");\\": 9063,
  ");}": 16872,
  ")<": 20914,
  ")</": 17922,
  ")<<": 11639,
  ")=": 22053,
  ")==": 13781,
  ")===": 37036,
  ")=>": 37834,
  ")>": 11193,
  ")>-": 49712,
  ")>::": 43763,
  ")>=": 44066,
  ")>>": 17109,
  ")?": 4697,
  ")?\"": 39795,
  ")?(": 25357,
  ")?;": 14769,
  ")?|": 34486,
  ")[": 5080,
  ")[\"": 41428,
  ")\\": 3817,
  ")\\\\": 28089,
  ")]": 2923,
  ")])": 19994,
  ")]),": 35353,
  ")]);": 30927,
  ")],": 17027,
  ")].": 26501,
  ")];": 10951,
  ")][": 45805,
  ")^": 31825,
  ")_": 15073,
  ")__": 12117,
  ")`": 21226,
  ")`,": 48844,
  ")``": 46952,
  "){": 1100,
  "){\"": 14202,
  "){(": 47893,
  "){}": 30788,
  ")|": 6864,
  ")|(": 27129,
  ")||": 11143,
  ")||(": 21059,
  ")}": 3489,
  ")})": 13820,
  ")}),": 17926,
  ")}).": 47174,
  ")});": 22948,
  ")})}": 48266,
  ")})},": 31872,
  ")},": 4337,
  ")},_": 39812,
  ")}.": 27792,
  ")};": 14139,
  ")}}": 11321,
  ")}}),": 36181,
  ")}},": 17040,
  ")}};": 47318,
  ")~": 36512,
  ")Ā": 39674,
  "*": 12,
  "*\"": 35369,
  "*\",": 33914,
  "*&": 38833,
  "*',": 39640,
  "*(": 5142,
  "*((": 19173,
  "*()": 35741,
  "*(?:": 33918,
  "*)": 2891,
  "*)\"": 27081,
  "*)&": 13633,
  "*)&(": 37063,
  "*)(": 9903,
  "*)((": 44705,
  "*),": 47635,
  "*);": 13591,
  "*)_": 46769,
  "**": 268,
  "**(": 44741,
  "**)": 22421,
  "**)&": 46826,
  "***": 5792,
  "****": 310,
  "*****": 16519,
  "******": 19989,
  "*******": 20797,
  "********": 402,
  "**********": 40768,
  "************": 10056,
  "*************": 31497,
  "**************": 29478,
  "***************": 35550,
  "****************": 554,
  "********************************": 967,
  "************************************************": 10144,
  "****************************************************************": 2005,
  "************************************************************************": 2826,
  "****************************************************************************": 3785,
  "********************************************************************************************************************************": 9265,
  "****************************************************************************************************************************************************************************************************************************************************************": 14448,
  "********************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************": 22181,
  "****************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************": 33829,
  "***************/": 28401,
  "*************/": 35518,
  "************/": 36864,
  "*******/": 28934,
  "******/": 8938,
  "*****/": 26770,
  "****/": 18516,
  "***/": 7626,
  "**/": 5180,
  "**:": 37500,
  "**\\": 37979,
  "**\\:": 47080,
  "*,": 6154,
  "*-": 8169,
  "*-*-": 33674,
  "*.": 19817,
  "*/": 1322,
  "*/)": 12934,
  "*/);": 30917,
  "*/,": 10848,
  "*/\\": 44810,
  "*:": 34518,
  "*=": 9748,
  "*=*=": 11824,
  "*=*=*=*=": 18704,
  "*=*=*=*=*=*=*=*=": 30901,
  "*>": 10321,
  "*>&": 38334,
  "*>(": 7931,
  "*>(&": 30248,
  "*>::": 38383,
  "*[": 47371,
  "*\\": 13913,
  "*\\\\": 20015,
  "*_": 29919,
  "*}": 26428,
  "*Ā": 46569,
  "+": 13,
  "+\"": 5087,
  "+\")": 20438,
  "+\",": 25234,
  "+\"-": 44079,
  "+\".": 33623,
  "+\"/": 22979,
  "+\":": 39984,
  "+\"_": 31262,
  "+$": 47718,
  "+%": 43316,
  "+'": 5789,
  "+'\"": 37080,
  "+','": 46094,
  "+(": 10123,
  "+((": 48943,
  "+)": 11284,
  "+)?": 41511,
  "+)\\": 46539,
  "++": 775,
  "++)": 1387,
  "++));": 46694,
  "++);": 13321,
  "++){": 9680,
  "++++": 11282,
  "++++++++": 18198,
  "++++++++++++++++": 30373,
  "++,": 8531,
  "++.": 49744,
  "++;": 2147,
  "++]": 6753,
  "++])": 37841,
  "++]);": 43187,
  "++],": 30403,
  "++].": 44050,
  "++];": 18455,
  "++]=": 26461,
  "+,": 36544,
  "+-": 22044,
  "+----------------": 40906,
  "+-]?": 48563,
  "+.": 35229,
  "+/": 20979,
  "+=": 5778,
  "+=\"": 21572,
  "+=(": 33432,
  "+=+=": 28151,
  "+=+=+=+=": 44115,
  "+\\": 17649,
  "+]": 48852,
  "+_": 44798,
  ",": 14,
  ",!": 9559,
  ",\"": 2210,
  ",\"\"": 27528,
  ",\"$": 47757,
  ",\"%": 29025,
  ",\",": 19914,
  ",\"./": 24468,
  ",\"\\": 21373,
  ",\"__": 34000,
  ",#": 33062,
  ",##": 46502,
  ",$": 11412,
  ",%": 7522,
  ",%%": 26586,
  ",&": 7362,
  ",'": 10737,
  ",(": 9202,
  ",)": 27289,
  ",))": 43381,
  ",),": 30588,
  ",*": 19386,
  ",+": 39167,
  ",,": 17297,
  ",,,,": 35597,
  ",-": 1720,
  ",-.": 34634,
  ",.": 12447,
  ",/*": 10582,
  ",[": 15418,
  ",[\"": 35598,
  ",[],\"": 41267,
  ",\\": 9863,
  ",\\\"": 14758,
  ",]+": 45328,
  ",_": 9815,
  ",_,": 47746,
  ",__": 14489,
  ",{": 10084,
  ",},": 27777,
  ",Ā": 29632,
  "-": 15,
  "-\"": 19758,
  "-\"+": 31012,
  "-\",": 32351,
  "-\"-": 43723,
  "-$": 42199,
  "-%": 12321,
  "-'": 25855,
  "-(": 14428,
  "-*/": 46924,
  "-+": 5380,
  "-+-+": 6349,
  "-+-+-+-+": 10458,
  "-+-+-+-+-+-+-+-+": 17168,
  "-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+": 29531,
  "--": 270,
  "--)": 8494,
  "--*/": 23618,
  "--+": 37112,
  "--,": 29375,
  "---": 3901,
  "---*/": 49597,
  "---+": 21545,
  "---+---+": 28628,
  "----": 308,
  "----+": 32341,
  "-----": 8269,
  "-----*/": 30065,
  "-----+": 33360,
  "------": 6242,
  "------+": 18144,
  "------+------+": 23344,
  "------+------+------+------+": 46384,
  "-------": 8726,
  "-------*/": 41281,
  "-------+": 29289,
  "--------": 398,
  "--------*/": 24646,
  "--------+": 35612,
  "---------": 9156,
  "---------*/": 20807,
  "---------+": 44308,
  "----------": 7158,
  "----------*/": 39175,
  "-----------": 9120,
  "-----------*/": 19515,
  "------------": 3372,
  "------------*/": 16687,
  "-------------": 6263,
  "-------------*/": 34204,
  "--------------": 8653,
  "---------------": 14578,
  "---------------*/": 36520,
  "----------------": 553,
  "--------------------------------": 980,
  "------------------------------------------------": 5648,
  "----------------------------------------------------------------": 2310,
  "----------------------------------------------------------------------": 12152,
  "--------------------------------------------------------------------------": 28728,
  "----------\\": 22748,
  "--;": 5382,
  "--;)": 36411,
  "-->": 33018,
  "-.": 4722,
  "-=": 15810,
  "->": 297,
  "->$": 39021,
  "->_": 4492,
  "->__": 21434,
  "-\\": 5729,
  "-\\\\": 24364,
  "-]+": 32108,
  "-_": 36405,
  "-Ā": 42369,
  ".": 16,
  ".\"": 5653,
  ".\"\"\"": 9996,
  ".\")": 11313,
  ".\"));": 26281,
  ".\"),": 21361,
  ".\");": 4947,
  ".\")]": 25328,
  ".\"+": 41128,
  ".\",": 4175,
  ".\",\"": 21300,
  ".\".": 32085,
  ".\";": 11578,
  ".\"},": 30445,
  ".#": 27739,
  ".$": 3658,
  ".$$": 22610,
  ".$.": 46761,
  ".${": 48169,
  ".%": 10567,
  ".'": 8590,
  ".')": 20062,
  ".'),": 43979,
  ".');": 16893,
  ".',": 8775,
  ".'/": 34949,
  ".';": 21847,
  ".(": 7402,
  ".(*": 9004,
  ".([]": 48345,
  ".)": 8274,
  ".),": 43506,
  ".).": 40628,
  ".);": 32322,
  ".*": 3494,
  ".*)": 35900,
  ".*/": 15010,
  ".*;": 6870,
  ".*?": 36138,
  ".*]]": 12862,
  ".*}}": 10774,
  ".*}})": 49496,
  ".*}},": 18523,
  ".+": 9592,
  ".+]]": 18364,
  ".+}}": 26218,
  ".+}},": 36192,
  ".,": 2753,
  "..": 661,
  "...": 1510,
  "...\"": 32233,
  "...\")": 40642,
  "...\");": 23845,
  "...\",": 32237,
  "...)": 5013,
  "...))": 41794,
  "...),": 43870,
  "...).": 48483,
  "...);": 40379,
  "...,": 29652,
  "....": 2914,
  ".....": 29049,
  "......": 18490,
  ".......": 30760,
  "........": 5658,
  ".........": 49445,
  "................": 11962,
  "................................": 25102,
  "...>": 31342,
  "...\\": 21795,
  "../": 2587,
  "../../": 4938,
  "../../../": 38246,
  "..]": 22578,
  "./": 3571,
  ".:": 32633,
  ".;": 19117,
  ".<": 13488,
  ".</": 3038,
  ".@": 34497,
  ".[": 37238,
  ".\\": 3836,
  ".]": 29127,
  ".]+": 34166,
  "._": 1118,
  "._$": 32617,
  "._.": 33472,
  ".__": 4727,
  ".`": 32258,
  ".`,": 46328,
  ".{": 18844,
  ".|": 35393,
  ".Ā": 32680,
  "/": 17,
  "/\"": 15043,
  "/\")": 45478,
  "/\");": 44287,
  "/\"+": 50071,
  "/\",": 18572,
  "/\";": 45800,
  "/\">": 49715,
  "/#": 12883,
  "/$": 34375,
  "/${": 30182,
  "/%": 9230,
  "/'": 3666,
  "/',": 22529,
  "/(": 12619,
  "/)": 25671,
  "/);": 43119,
  "/*": 567,
  "/*!": 17540,
  "/*!<": 25752,
  "/**": 2150,
  "/**/": 17329,
  "/**/'": 4309,
  "/**/';',/**/'": 49364,
  "/**<": 22067,
  "/*.": 41150,
  "/*=": 37620,
  "/+": 23653,
  "/,": 14533,
  "/-": 31048,
  "/.": 11799,
  "//": 269,
  "//!": 18482,
  "//#": 47849,
  "//*": 43609,
  "//**": 31292,
  "//----------------------------------------------------------------": 43599,
  "///": 2489,
  "////": 407,
  "/////": 28583,
  "//////": 25385,
  "///////": 27038,
  "////////": 538,
  "/////////": 36089,
  "////////////////": 814,
  "////////////////////////": 19783,
  "////////////////////////////////": 1333,
  "////////////////////////////////////////////////////////////////": 2346,
  "////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////": 4224,
  "////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////": 6593,
  "////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////": 10462,
  "////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////": 16295,
  "////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////": 25809,
  "////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////": 39477,
  "///<": 19045,
  "///</": 31797,
  "/:": 26398,
  "/<": 34575,
  "/=": 40004,
  "/>": 3909,
  "/>.": 9698,
  "/><": 28107,
  "/?": 28228,
  "/@": 44889,
  "/[": 30294,
  "/\\": 10420,
  "/\\/\\": 42926,
  "/^": 27218,
  "/_": 19664,
  "/{": 6972,
  "/{}/": 45728,
  "/|": 39001,
  "/~": 46540,
  "/Ā": 37409,
  "0": 18,
  "00": 264,
  "000": 575,
  "0000": 363,
  "00000": 2328,
  "000000": 1203,
  "0000000": 1730,
  "00000000": 910,
  "000000000": 13626,
  "0000000000": 18814,
  "00000000000": 14870,
  "000000000000": 11708,
  "0000000000000": 18617,
  "00000000000000": 22414,
  "000000000000000": 16427,
  "0000000000000000": 6177,
  "000000000000000000": 40837,
  "00000000000000000000000000000000": 17152,
  "0000000000000000000000000000000000000000000000000000000000000000": 40711,
  "00000001": 4592,
  "00000002": 6489,
  "00000003": 15015,
  "00000004": 8902,
  "00000005": 27859,
  "00000006": 26031,
  "00000007": 21707,
  "00000008": 9787,
  "00000009": 37529,
  "0000001": 10110,
  "00000010": 10159,
  "00000011": 38762,
  "00000014": 46413,
  "00000018": 33694,
  "0000002": 33301,
  "00000020": 8733,
  "0000003": 24467,
  "00000030": 36140,
  "0000004": 47428,
  "00000040": 12614,
  "0000007": 7717,
  "00000070": 50223,
  "00000080": 13150,
  "000001": 5267,
  "0000010": 45797,
  "00000100": 11220,
  "0000014": 28087,
  "000002": 16754,
  "00000200": 13695,
  "000003": 11875,
  "00000300": 38787,
  "000004": 16962,
  "00000400": 14389,
  "000005": 25394,
  "000006": 29034,
  "000007": 22410,
  "000008": 26056,
  "00000800": 15021,
  "000009": 35284,
  "00001": 6520,
  "000010": 44716,
  "00001000": 14475,
  "00002": 16437,
  "000020": 46793,
  "00002000": 16033,
  "000021": 46977,
  "000022": 27344,
  "00003": 15856,
  "000030": 31701,
  "00004": 29797,
  "00004000": 16153,
  "00005": 33317,
  "00006": 37987,
  "00007": 6991,
  "00008": 21188,
  "000080": 27481,
  "00008000": 15512,
  "00009": 17597,
  "0001": 2571,
  "00010": 27482,
  "000100": 43469,
  "00010000": 13882,
  "00010001": 38705,
  "00011": 49040,
  "000118": 48918,
  "00016": 44270,
  "0002": 5577,
  "00020": 41858,
  "00020000": 16376,
  "0003": 8382,
  "00030000": 28918,
  "0004": 6556,
  "00040000": 17999,
  "0005": 13102,
  "0006": 14070,
  "0007": 11764,
  "0008": 3198,
  "00080": 50062,
  "00080000": 17552,
  "0009": 17613,
  "001": 3777,
  "0010": 9105,
  "00100": 28256,
  "001000": 36292,
  "00100000": 17618,
  "0011": 13560,
  "0012": 22588,
  "0013": 27071,
  "0014": 20342,
  "0015": 25953,
  "0016": 30113,
  "0017": 32188,
  "0018": 6494,
  "0019": 30818,
  "002": 5352,
  "0020": 11163,
  "00200000": 19620,
  "0021": 27648,
  "0022": 32195,
  "0023": 35141,
  "0024": 23121,
  "0025": 31285,
  "0026": 33138,
  "0027": 37779,
  "0028": 17138,
  "0029": 21384,
  "003": 4310,
  "0030": 23270,
  "0031": 41724,
  "0032": 34561,
  "0033": 32146,
  "0034": 28525,
  "0035": 43246,
  "0036": 41113,
  "0037": 39772,
  "0038": 30254,
  "0039": 27839,
  "004": 6229,
  "0040": 4174,
  "00400": 38809,
  "00400000": 20155,
  "0041": 31946,
  "0042": 40353,
  "0043": 35081,
  "0044": 26561,
  "0045": 30295,
  "0046": 44827,
  "0047": 40082,
  "0048": 38378,
  "0049": 36015,
  "005": 8002,
  "0050": 32033,
  "0053": 44730,
  "0054": 36308,
  "0055": 29204,
  "0057": 43971,
  "0058": 42783,
  "0059": 43493,
  "006": 7726,
  "0060": 32051,
  "0061": 22589,
  "0062": 28480,
  "0063": 40161,
  "0064": 34182,
  "0065": 29856,
  "0066": 29595,
  "0067": 40234,
  "0068": 38534,
  "0069": 31869,
  "007": 6402,
  "0070": 27109,
  "0071": 44272,
  "0072": 44711,
  "0073": 42054,
  "0074": 34421,
  "0075": 37741,
  "0077": 40411,
  "0078": 32012,
  "0079": 36166,
  "008": 7204,
  "0080": 7561,
  "00800000": 18939,
  "0081": 47505,
  "0082": 45720,
  "0083": 39146,
  "0084": 43069,
  "0086": 49055,
  "0087": 44580,
  "0088": 29820,
  "009": 10816,
  "0090": 29045,
  "01": 493,
  "010": 6399,
  "0100": 9343,
  "01000": 37917,
  "010000": 34825,
  "01000000": 17229,
  "0101": 8883,
  "01010101": 24962,
  "0101010101010101": 48111,
  "0102": 33607,
  "0103": 29356,
  "0104": 33898,
  "0105": 50114,
  "0106": 33611,
  "0107": 45881,
  "0108": 34983,
  "0109": 30683,
  "011": 9956,
  "0110": 30872,
  "0111": 30730,
  "0112": 45633,
  "0113": 44356,
  "0114": 47644,
  "0118": 49824,
  "012": 11736,
  "0120": 43448,
  "0123": 19693,
  "01234": 23955,
  "01234567": 27806,
  "0123456789": 1496,
  "01234567890": 10504,
  "01234567890123456789": 1594,
  "0123456789012345678901234567890123456789": 2708,
  "012345678901234567890123456789012345678901234567890": 11165,
  "01234567890123456789012345678901234567890123456789012345678901234567890123456789": 4568,
  "0123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789": 11121,
  "0124": 31853,
  "0127": 44237,
  "013": 12438,
  "0132": 36001,
  "014": 12055,
  "0140": 38831,
  "015": 13914,
  "016": 9663,
  "017": 12623,
  "018": 12774,
  "0180": 31705,
  "0188": 48892,
  "019": 13678,
  "02": 1052,
  "020": 6035,
  "0200": 8348,
  "02000": 22299,
  "020000": 45836,
  "02000000": 19784,
  "0201": 27160,
  "0202": 49138,
  "0203": 42697,
  "02069": 22145,
  "0208": 36582,
  "021": 9362,
  "0210": 48941,
  "0213": 44262,
  "022": 13578,
  "023": 20741,
  "024": 17088,
  "0249": 40123,
  "025": 19854,
  "0259": 40119,
  "026": 14551,
  "0269": 34763,
  "027": 16336,
  "0279": 40300,
  "028": 14346,
  "0280": 41123,
  "0289": 40317,
  "029": 17981,
  "03": 935,
  "030": 9830,
  "0300": 14754,
  "03000000": 39969,
  "0301": 19087,
  "0302": 31046,
  "0303": 12648,
  "03030303": 26746,
  "0303030303030303": 48079,
  "0304": 33757,
  "0306": 41418,
  "0307": 34632,
  "0308": 31509,
  "031": 15449,
  "032": 16154,
  "033": 12359,
  "0338": 36564,
  "034": 14911,
  "0340": 42593,
  "0342": 46320,
  "0345": 35049,
  "035": 15907,
  "0359": 39043,
  "036": 17689,
  "0369": 39520,
  "037": 16574,
  "038": 14045,
  "039": 14732,
  "04": 1025,
  "040": 9184,
  "0400": 8814,
  "04000": 49104,
  "040000": 49507,
  "04000000": 20330,
  "0401": 28785,
  "041": 16567,
  "0418": 39114,
  "042": 17301,
  "0420": 49635,
  "043": 8719,
  "0430": 19893,
  "0431": 47721,
  "0432": 30911,
  "0433": 48218,
  "0434": 33310,
  "0435": 21665,
  "0438": 23755,
  "044": 13032,
  "0440": 24224,
  "0441": 29904,
  "0442": 26257,
  "0443": 35265,
  "045": 14583,
  "046": 17987,
  "047": 17267,
  "048": 9914,
  "049": 15920,
  "05": 1465,
  "050": 21138,
  "0500": 29463,
  "051": 21327,
  "052": 15123,
  "053": 21794,
  "054": 22496,
  "055": 22298,
  "056": 26305,
  "057": 19459,
  "058": 8064,
  "059": 20209,
  "06": 1403,
  "060": 15833,
  "0600": 23975,
  "061": 23137,
  "062": 17426,
  "0625": 43642,
  "0627": 27552,
  "0628": 46487,
  "063": 24340,
  "0631": 41354,
  "0633": 47043,
  "064": 9511,
  "0644": 35961,
  "0645": 41425,
  "0646": 41012,
  "0648": 41112,
  "065": 21436,
  "066": 21173,
  "067": 21808,
  "068": 22186,
  "069": 17231,
  "07": 1446,
  "070": 17420,
  "0700": 19175,
  "071": 25409,
  "072": 20396,
  "073": 24011,
  "074": 21738,
  "075": 22738,
  "076": 23667,
  "077": 31006,
  "078": 18267,
  "079": 21247,
  "08": 1189,
  "080": 9306,
  "0800": 9085,
  "08000": 36391,
  "080000": 39396,
  "08000000": 20175,
  "0801": 43657,
  "0808": 24251,
  "081": 22369,
  "0818": 24659,
  "082": 24640,
  "0828": 40084,
  "083": 24371,
  "084": 17453,
  "085": 19445,
  "086": 18860,
  "087": 21090,
  "088": 20651,
  "0880": 33595,
  "089": 33204,
  "0899": 19962,
  "09": 1551,
  "090": 12710,
  "0900": 16308,
  "0903": 36569,
  "091": 18944,
  "0910": 27053,
  "092": 22076,
  "093": 20805,
  "094": 18657,
  "095": 21282,
  "096": 11113,
  "097": 18045,
  "098": 20631,
  "099": 31244,
  "1": 19,
  "10": 588,
  "100": 1801,
  "1000": 2570,
  "10000": 6947,
  "100000": 14062,
  "1000000": 14818,
  "10000000": 12866,
  "100000000": 36740,
  "1000000000": 50018,
  "10001": 24600,
  "10008": 48237,
  "1001": 20278,
  "1002": 20818,
  "1003": 27991,
  "1004": 24541,
  "1005": 35979,
  "1006": 38603,
  "1007": 35007,
  "1008": 27126,
  "1009": 42900,
  "101": 3932,
  "1010": 21079,
  "10101": 42620,
  "1011": 21480,
  "1013": 39550,
  "1014": 47655,
  "1015": 39592,
  "1019": 41605,
  "102": 7154,
  "1020": 32820,
  "1021": 37060,
  "1022": 32959,
  "1023": 22606,
  "1024": 7919,
  "1025": 33756,
  "1026": 43032,
  "1027": 46345,
  "1028": 39467,
  "1029": 45337,
  "103": 6804,
  "1030": 39120,
  "1031": 50040,
  "1032": 43096,
  "1034": 45243,
  "104": 5899,
  "1040": 31303,
  "1043": 47300,
  "1047": 35563,
  "1048": 38770,
  "105": 6631,
  "1050": 38080,
  "106": 6806,
  "1064": 32597,
  "1067": 38985,
  "107": 7720,
  "1078": 38722,
  "108": 7284,
  "1080": 29252,
  "1088": 43049,
  "1089": 33780,
  "109": 7683,
  "1099": 39448,
  "11": 631,
  "110": 4960,
  "1100": 14967,
  "11000": 44626,
  "1100000": 26113,
  "1101": 21275,
  "1105": 30110,
  "1108": 46941,
  "111": 5484,
  "1110": 33972,
  "1111": 5837,
  "111111": 28557,
  "11111111": 16531,
  "1111111111111111": 45144,
  "1112": 43677,
  "112": 6742,
  "1123": 37516,
  "113": 8746,
  "1133": 49005,
  "1135": 43806,
  "114": 7020,
  "115": 7593,
  "1152": 46571,
  "115200": 49140,
  "1159": 34697,
  "116": 6618,
  "1166": 49304,
  "117": 8262,
  "118": 8781,
  "119": 8813,
  "1199": 31564,
  "12": 594,
  "120": 6265,
  "1200": 13956,
  "1201": 33282,
  "1204": 47110,
  "1206": 45767,
  "1207": 50151,
  "121": 9561,
  "1211": 44154,
  "1212": 18054,
  "12121212": 40037,
  "1213": 47260,
  "1216": 42673,
  "122": 9760,
  "1227": 46666,
  "123": 5772,
  "1234": 7281,
  "12345": 25387,
  "123456": 38371,
  "12345678": 32386,
  "123456789": 17406,
  "1234567890": 32815,
  "12345678901234567890": 49707,
  "124": 8062,
  "1249": 47889,
  "125": 7222,
  "1250": 27735,
  "1251": 25870,
  "1252": 40328,
  "126": 9307,
  "1269": 47122,
  "127": 5925,
  "1271": 20856,
  "1273": 41046,
  "128": 2185,
  "1280": 23198,
  "1284": 40599,
  "12864": 49052,
  "129": 9208,
  "13": 809,
  "130": 8066,
  "1300": 24988,
  "1301": 7082,
  "1305": 19827,
  "1306": 35663,
  "1307": 15007,
  "1308": 38514,
  "131": 9679,
  "1310": 30491,
  "1313": 44640,
  "132": 7228,
  "133": 9177,
  "134": 7353,
  "1340": 43077,
  "1345": 40448,
  "135": 8524,
  "136": 9314,
  "1362": 32070,
  "137": 9080,
  "1373": 33798,
  "138": 10024,
  "1380": 37932,
  "139": 7955,
  "1394": 23647,
  "14": 832,
  "140": 9717,
  "1400": 25551,
  "1409": 43839,
  "141": 11012,
  "1411": 44752,
  "1414": 40283,
  "1415": 38551,
  "14159": 46517,
  "142": 10361,
  "1427": 48956,
  "1429": 38867,
  "143": 11428,
  "144": 8045,
  "1440": 44675,
  "145": 10396,
  "1456": 41942,
  "14577": 48155,
  "146": 9236,
  "1466": 48321,
  "147": 10063,
  "148": 8543,
  "1480": 16976,
  "1483": 48567,
  "149": 10572,
  "15": 791,
  "150": 7845,
  "1500": 22435,
  "151": 11904,
  "1510": 45467,
  "1518": 46265,
  "152": 9929,
  "153": 12224,
  "1536": 45002,
  "154": 8709,
  "155": 10903,
  "1550": 39066,
  "1555": 38168,
  "156": 9924,
  "157": 10568,
  "1572": 43636,
  "158": 10203,
  "158592": 40528,
  "1588": 40167,
  "159": 9695,
  "15936": 48952,
  "16": 559,
  "160": 7027,
  "1600": 21326,
  "1601": 49490,
  "161": 13039,
  "1610": 38684,
  "1613": 44318,
  "1614": 42212,
  "1615": 48608,
  "1616": 33588,
  "1617": 39308,
  "162": 12023,
  "1624": 50230,
  "163": 11401,
  "16384": 41996,
  "164": 8427,
  "1646": 48115,
  "165": 9578,
  "166": 10412,
  "1666666666": 46542,
  "167": 10591,
  "1677": 45414,
  "168": 8133,
  "1680": 45386,
  "1688": 39540,
  "169": 9344,
  "17": 999,
  "170": 8538,
  "1700": 42455,
  "1704": 45608,
  "171": 13172,
  "1712": 19990,
  "1717": 37084,
  "172": 12966,
  "1724": 41295,
  "173": 11584,
  "1737": 47892,
  "174": 11528,
  "175": 11556,
  "17590": 13979,
  "176": 11097,
  "1760": 48394,
  "1761": 46087,
  "177": 11441,
  "1770": 49876,
  "178": 10616,
  "179": 11101,
  "18": 927,
  "180": 7608,
  "1800": 19659,
  "1801": 41997,
  "181": 13619,
  "1816": 48217,
  "1818": 49162,
  "182": 12316,
  "1822": 45685,
  "1824": 44650,
  "18271": 43753,
  "183": 11959,
  "184": 11052,
  "1843": 40254,
  "185": 11278,
  "186": 10425,
  "187": 11292,
  "1875": 44863,
  "188": 9497,
  "1880": 48105,
  "189": 11294,
  "19": 985,
  "190": 10990,
  "1900": 37690,
  "19058": 16625,
  "191": 11919,
  "1919": 44109,
  "192": 5207,
  "1920": 43706,
  "193": 12094,
  "1938": 49380,
  "1939": 39541,
  "194": 11364,
  "195": 11397,
  "196": 11957,
  "197": 11458,
  "1970": 33899,
  "1977": 42149,
  "1978": 48010,
  "198": 11808,
  "1984": 46917,
  "199": 10288,
  "1996": 44986,
  "1997": 29710,
  "1998": 29806,
  "1999": 23314,
  "2": 20,
  "20": 722,
  "200": 2095,
  "2000": 3819,
  "20000": 12162,
  "200000": 16276,
  "2000000": 23069,
  "20000000": 9122,
  "200000000": 40678,
  "20001": 29254,
  "200074": 35857,
  "2001": 14749,
  "2002": 20045,
  "2003": 19011,
  "2004": 15327,
  "2005": 17692,
  "2006": 15794,
  "2007": 15113,
  "2008": 13963,
  "2009": 16456,
  "201": 2355,
  "2010": 14660,
  "2011": 13753,
  "2012": 13343,
  "2013": 15067,
  "2014": 12373,
  "2015": 10516,
  "2016": 11276,
  "2017": 9916,
  "2018": 10066,
  "2019": 10447,
  "202": 10592,
  "2020": 8404,
  "2021": 9625,
  "20210": 30024,
  "2022": 33248,
  "2028": 32691,
  "2029": 43004,
  "203": 10391,
  "2030": 42429,
  "2039": 36437,
  "204": 9459,
  "2040": 33761,
  "2047": 45517,
  "2048": 18214,
  "205": 10701,
  "2055": 37964,
  "2056": 11044,
  "2057": 30620,
  "206": 9747,
  "2062": 48316,
  "2063": 35494,
  "2064": 40105,
  "207": 10378,
  "208": 9987,
  "209": 11594,
  "21": 1290,
  "210": 6415,
  "2100": 19676,
  "2101": 48004,
  "2109": 48125,
  "211": 11187,
  "2110": 7260,
  "212": 11939,
  "213": 11505,
  "2130": 43631,
  "214": 8774,
  "2147483": 34378,
  "215": 12764,
  "216": 11069,
  "2160": 42470,
  "217": 10030,
  "218": 13027,
  "219": 14296,
  "22": 1109,
  "220": 8275,
  "2200": 18191,
  "221": 12680,
  "222": 10936,
  "2222": 16194,
  "22222222": 41849,
  "2223": 48121,
  "223": 10807,
  "224": 7355,
  "225": 8986,
  "226": 11154,
  "227": 11324,
  "2272": 44671,
  "228": 13125,
  "2280": 44936,
  "229": 11224,
  "2292": 38823,
  "23": 773,
  "230": 9829,
  "2300": 48526,
  "231": 9095,
  "2312": 43821,
  "2315": 40843,
  "232": 8942,
  "233": 11559,
  "234": 1340,
  "2341": 35050,
  "23456": 17894,
  "23456789": 1438,
  "235": 11757,
  "236": 11051,
  "237": 11467,
  "238": 12070,
  "23885": 23014,
  "239": 10486,
  "24": 924,
  "240": 7961,
  "2400": 12916,
  "2401": 41660,
  "241": 13740,
  "2410": 15422,
  "2412": 33114,
  "2415": 32171,
  "242": 10470,
  "2424": 48946,
  "243": 12691,
  "2430": 42010,
  "244": 10464,
  "2440": 42356,
  "245": 10547,
  "246": 11588,
  "247": 11646,
  "248": 11302,
  "249": 10941,
  "25": 953,
  "250": 7687,
  "2500": 20720,
  "2501": 49841,
  "251": 12061,
  "252": 12551,
  "253": 12515,
  "254": 10940,
  "255": 3978,
  "25519": 17272,
  "256": 2337,
  "2560": 49754,
  "257": 13559,
  "258": 8682,
  "2580": 43796,
  "25840": 15976,
  "259": 12830,
  "26": 1286,
  "260": 12703,
  "2600": 49410,
  "261": 17576,
  "262": 13158,
  "2626": 35768,
  "2627": 48680,
  "263": 15495,
  "264": 7692,
  "2640": 45412,
  "265": 12705,
  "266": 12881,
  "267": 14957,
  "268": 15353,
  "2680": 32906,
  "269": 14053,
  "27": 1252,
  "270": 13542,
  "2700": 47165,
  "2701": 28591,
  "271": 15804,
  "2712": 35201,
  "272": 16512,
  "273": 18094,
  "274": 14108,
  "275": 15383,
  "276": 15646,
  "277": 15186,
  "278": 14917,
  "279": 14672,
  "28": 1137,
  "280": 13868,
  "2800": 22015,
  "281": 16846,
  "282": 17753,
  "2820": 50246,
  "283": 18997,
  "2835": 21704,
  "284": 15396,
  "2841": 46852,
  "285": 15116,
  "2857": 44500,
  "286": 14008,
  "2860": 48633,
  "287": 14619,
  "2870": 48477,
  "288": 13719,
  "2880": 24302,
  "289": 15853,
  "29": 1309,
  "290": 16253,
  "291": 17842,
  "292": 17672,
  "2928": 41805,
  "293": 18864,
  "294": 16305,
  "295": 13920,
  "296": 15151,
  "297": 16719,
  "298": 15497,
  "299": 15827,
  "3": 21,
  "30": 1122,
  "300": 4499,
  "3000": 11630,
  "30000": 28275,
  "3000000": 49511,
  "30000000": 26201,
  "3002": 44416,
  "3008": 14593,
  "301": 10195,
  "302": 10523,
  "3026": 49886,
  "303": 8687,
  "304": 10605,
  "3040": 47486,
  "305": 12639,
  "306": 11465,
  "3066": 43018,
  "307": 11890,
  "308": 12472,
  "309": 12552,
  "3099": 37075,
  "31": 1421,
  "310": 9326,
  "3100": 25268,
  "311": 15870,
  "312": 15557,
  "313": 16329,
  "314": 14695,
  "315": 16174,
  "316": 19317,
  "317": 18388,
  "318": 18425,
  "319": 19919,
  "32": 419,
  "320": 9602,
  "3200": 16598,
  "32000": 47253,
  "321": 13003,
  "322": 15570,
  "323": 11753,
  "3232": 27245,
  "324": 12607,
  "325": 13731,
  "326": 13245,
  "3264": 41680,
  "327": 9710,
  "3270": 35292,
  "32767": 34481,
  "32768": 30045,
  "328": 11676,
  "3288": 31657,
  "329": 13774,
  "33": 1011,
  "330": 13093,
  "3306": 47965,
  "3308": 8265,
  "331": 16648,
  "332": 18371,
  "3328": 43006,
  "333": 11374,
  "3332": 45919,
  "3333": 4443,
  "333333": 28550,
  "33333333": 10289,
  "333333333333": 36414,
  "3334": 47400,
  "3339": 33979,
  "334": 15029,
  "335": 11942,
  "336": 14146,
  "3368": 41740,
  "337": 15074,
  "338": 15911,
  "339": 14060,
  "3399": 35505,
  "34": 1331,
  "340": 15200,
  "3400": 46735,
  "341": 16177,
  "3410": 37676,
  "342": 16960,
  "343": 16944,
  "3430": 32214,
  "3434": 39450,
  "344": 15322,
  "345": 13159,
  "346": 14622,
  "347": 14678,
  "348": 15458,
  "349": 15585,
  "35": 1487,
  "350": 15607,
  "3501": 34925,
  "351": 16569,
  "352": 14965,
  "353": 18098,
  "3533": 41288,
  "354": 15039,
  "355": 14793,
  "356": 21534,
  "357": 14103,
  "358": 14744,
  "3589": 30694,
  "359": 14143,
  "36": 1363,
  "360": 9744,
  "3600": 32219,
  "361": 19419,
  "362": 18819,
  "363": 18623,
  "364": 16270,
  "365": 12340,
  "366": 14183,
  "367": 10962,
  "368": 13569,
  "36854": 45316,
  "36854775": 47195,
  "369": 15190,
  "37": 1449,
  "370": 15590,
  "3700": 48688,
  "3709": 46891,
  "371": 18965,
  "372": 18146,
  "3720": 37439,
  "372036854775": 48709,
  "3722": 33792,
  "373": 14369,
  "374": 13552,
  "375": 12350,
  "376": 14624,
  "377": 3448,
  "378": 17343,
  "379": 15438,
  "38": 1483,
